---
title: A new welfare measure of inequality
tags: notebook, population axiology, social welfare, econometrics, data analysis
published: 2018-02-20
---
# Local Variables:
# before-save-hook: org-babel-execute-buffer
# End:
#+SETUPFILE: ../../default-options.org

#+BEGIN_SRC ein
var parse = require('csv-parse/lib/sync')
var plot = require('./content/data/offline/plot-helper')
var {create, env} = require('sanctuary')
var S = create({ checkTypes: false, env })
#+END_SRC

#+RESULTS[7460260e44a54fcb17bb714cd20a0cd495829b45]:

#+BEGIN_SRC ein
var rawData = fs.readFileSync('content/data/offline/WIID3.4_19JAN2017New.csv')
var data = parse(rawData, { columns: true })
S.maybeToNullable(S.take(1, records))
#+END_SRC

#+RESULTS[c748a33ff812809032a270a788fa043e816b2d9f]:
#+begin_example
[ { Country: 'Afghanistan',
    Countrycode3: 'AFG',
    Countrycode2: 'AF',
    Year: '2007',
    Population: '26.91153',
    Incomegroup: 'Low income',
    Mean: '36588',
    Median: '',
    Gini: '29',
    Source: 'National Risk and Vulnerability Assessment',
    D1: '',
    D2: '',
    D3: '',
    D4: '',
    D5: '',
    D6: '',
    D7: '',
    D8: '',
    D9: '',
    D10: '',
    Q1: '9',
    Q2: '13',
    Q3: '17',
    Q4: '22',
    Q5: '39',
    P5: '',
    P95: '',
    Revision: 'New 2013',
    Quality: 'High',
    Source_Comments: 'European commision and Government of Afghanistan',
    Region: 'Asia',
    Region_sub: 'Southern Asia',
    Currency: 'AF',
    Reference_Period: 'Month',
    Welfaredefn: 'Consumption',
    IncSharU: 'Household',
    UofAnala: 'Person',
    Equivsc: 'Per capita',
    AreaCovr: 'All',
    PopCovr: 'All',
    AgeCovr: 'All',
    EU: 'Non-EU',
    OECD: 'Non-OECD',
    Year_cat: '2000-2009',
    Welfaredefn_new: 'Consumption',
    Equivsc_new: 'Household per capita',
    AgeCovr_new: 'All',
    AreaCovr_new: 'All',
    PopCovr_new: 'All',
    IncSharU_new: 'Household',
    UofAnala_new: 'Person',
    Exchangerate: '49.9620177703972',
    Mean_usd: '732.320007324219',
    Median_usd: '' } ]
#+end_example

#+BEGIN_SRC ein
var indices = S.range(1, 11)
var latestWithDeciles = S.pipe([
  S.filter(r =>
    indices.every(i => r['D' + i.toString()] !== '')
    && r.Mean_usd !== ''),
  S.groupBy(S.on(S.equals)(r => r.Country)),
  S.map(
    S.pipe([
      S.sortBy(r => Number.parseInt(r.Year, 10)),
      S.last,
      S.maybeToNullable
    ])
  ),
])(data)
S.maybeToNullable(S.take(5, latestWithDeciles))
#+END_SRC

#+RESULTS[50f913b7742a3c9e200d042eb4404d538fb8947f]:
#+begin_example
[ { Country: 'Albania',
    Countrycode3: 'ALB',
    Countrycode2: 'AL',
    Year: '1996',
    Population: '3.092034',
    Incomegroup: 'Upper middle income',
    Mean: '58192.8',
    Median: '',
    Gini: '28',
    Source: 'Deininger & Squire, World Bank 2004',
    D1: '3.68',
    D2: '5.02',
    D3: '6.01',
    D4: '7.02',
    D5: '8.06',
    D6: '9.11',
    D7: '10.64',
    D8: '12.54',
    D9: '15.12',
    D10: '22.8',
    Q1: '8.7',
    Q2: '13.03',
    Q3: '17.16',
    Q4: '23.18',
    Q5: '37.92',
    P5: '',
    P95: '',
    Revision: '',
    Quality: 'Average',
    Source_Comments: 'Employment and Welfare Survey',
    Region: 'Europe',
    Region_sub: 'Southern Europe',
    Currency: 'Leke',
    Reference_Period: 'Month',
    Welfaredefn: 'Consumption',
    IncSharU: 'Household',
    UofAnala: 'Person',
    Equivsc: 'Per capita',
    AreaCovr: 'All, excl Tirana',
    PopCovr: 'All',
    AgeCovr: 'All',
    EU: 'Non-EU',
    OECD: 'Non-OECD',
    Year_cat: '1990-1999',
    Welfaredefn_new: 'Consumption',
    Equivsc_new: 'Household per capita',
    AgeCovr_new: 'All',
    AreaCovr_new: 'Other',
    PopCovr_new: 'All',
    IncSharU_new: 'Household',
    UofAnala_new: 'Person',
    Exchangerate: '104.498916666667',
    Mean_usd: '556.869995117188',
    Median_usd: '' },
  { Country: 'Algeria',
    Countrycode3: 'DZA',
    Countrycode2: 'DZ',
    Year: '1995',
    Population: '28.9043',
    Incomegroup: 'Upper middle income',
    Mean: '1896',
    Median: '',
    Gini: '35.3',
    Source: 'World Bank Poverty Monitoring Database 2002',
    D1: '2.87',
    D2: '4.1',
    D3: '5.22',
    D4: '6.33',
    D5: '7.48',
    D6: '8.75',
    D7: '10.29',
    D8: '12.34',
    D9: '15.73',
    D10: '26.89',
    Q1: '6.97',
    Q2: '11.55',
    Q3: '16.23',
    Q4: '22.63',
    Q5: '42.62',
    P5: '',
    P95: '',
    Revision: '',
    Quality: 'Low',
    Source_Comments: 'Enquete national sur la mesure des nivaux de vie de menages Algeriens',
    Region: 'Africa',
    Region_sub: 'Northern Africa',
    Currency: 'USD',
    Reference_Period: 'Month',
    Welfaredefn: 'Consumption',
    IncSharU: 'Household',
    UofAnala: 'Person',
    Equivsc: 'Per capita',
    AreaCovr: 'All',
    PopCovr: 'All',
    AgeCovr: 'All',
    EU: 'Non-EU',
    OECD: 'Non-OECD',
    Year_cat: '1990-1999',
    Welfaredefn_new: 'Consumption',
    Equivsc_new: 'Household per capita',
    AgeCovr_new: 'All',
    AreaCovr_new: 'All',
    PopCovr_new: 'All',
    IncSharU_new: 'Household',
    UofAnala_new: 'Person',
    Exchangerate: '1',
    Mean_usd: '1896',
    Median_usd: '' },
  { Country: 'Argentina',
    Countrycode3: 'ARG',
    Countrycode2: 'AR',
    Year: '2013',
    Population: '42.538304',
    Incomegroup: 'High income: non-OECD',
    Mean: '31548',
    Median: '',
    Gini: '42',
    Source: 'Socio-Economic Database for Latin America and the Caribbean (SEDLAC) 2016',
    D1: '1.7',
    D2: '3.2',
    D3: '4.3',
    D4: '5.5',
    D5: '6.8',
    D6: '8.3',
    D7: '10.2',
    D8: '12.7',
    D9: '16.6',
    D10: '30.5',
    Q1: '4.9',
    Q2: '9.8',
    Q3: '15.1',
    Q4: '22.9',
    Q5: '47.1',
    P5: '',
    P95: '',
    Revision: 'New 2017',
    Quality: 'High',
    Source_Comments: 'First half of the year',
    Region: 'Americas',
    Region_sub: 'South America',
    Currency: 'LCU',
    Reference_Period: 'Year',
    Welfaredefn: 'Income, net',
    IncSharU: 'Household',
    UofAnala: 'Person',
    Equivsc: 'Per capita',
    AreaCovr: 'EPHC',
    PopCovr: 'All',
    AgeCovr: 'All',
    EU: 'Non-EU',
    OECD: 'Non-OECD',
    Year_cat: '2010-2015',
    Welfaredefn_new: 'Income, disposable',
    Equivsc_new: 'Household per capita',
    AgeCovr_new: 'All',
    AreaCovr_new: 'Urban',
    PopCovr_new: 'All',
    IncSharU_new: 'Household',
    UofAnala_new: 'Person',
    Exchangerate: '5.45935266465704',
    Mean_usd: '5778.72021484375',
    Median_usd: '' },
  { Country: 'Armenia',
    Countrycode3: 'ARM',
    Countrycode2: 'AM',
    Year: '2003',
    Population: '3.03642',
    Incomegroup: 'Lower middle income',
    Mean: '178764',
    Median: '',
    Gini: '48.4',
    Source: 'Transmonee 2005',
    D1: '1.3',
    D2: '2.7',
    D3: '4.11',
    D4: '5.06',
    D5: '6.16',
    D6: '7.35',
    D7: '9.04',
    D8: '11.67',
    D9: '15.67',
    D10: '36.94',
    Q1: '4',
    Q2: '9.17',
    Q3: '13.5',
    Q4: '20.72',
    Q5: '52.61',
    P5: '',
    P95: '',
    Revision: 'New 2007',
    Quality: 'Low',
    Source_Comments: '',
    Region: 'Asia',
    Region_sub: 'Western Asia',
    Currency: 'Drams',
    Reference_Period: 'Month',
    Welfaredefn: 'Income, net',
    IncSharU: 'Household',
    UofAnala: 'Person',
    Equivsc: 'Per capita',
    AreaCovr: 'All',
    PopCovr: 'All',
    AgeCovr: 'All',
    EU: 'Non-EU',
    OECD: 'Non-OECD',
    Year_cat: '2000-2009',
    Welfaredefn_new: 'Income, disposable',
    Equivsc_new: 'Household per capita',
    AgeCovr_new: 'All',
    AreaCovr_new: 'All',
    PopCovr_new: 'All',
    IncSharU_new: 'Household',
    UofAnala_new: 'Person',
    Exchangerate: '578.762954545455',
    Mean_usd: '308.869995117188',
    Median_usd: '' },
  { Country: 'Australia',
    Countrycode3: 'AUS',
    Countrycode2: 'AU',
    Year: '2010',
    Population: '22.162863',
    Incomegroup: 'High income: OECD',
    Mean: '49625',
    Median: '41996',
    Gini: '33.3',
    Source: 'Luxembourg Income Study (LIS) 2016',
    D1: '2.81',
    D2: '4.37',
    D3: '5.53',
    D4: '6.74',
    D5: '7.86',
    D6: '9.14',
    D7: '10.66',
    D8: '12.55',
    D9: '15.26',
    D10: '25.09',
    Q1: '7.18',
    Q2: '12.27',
    Q3: '17',
    Q4: '23.21',
    Q5: '40.35',
    P5: '1.03',
    P95: '15.63',
    Revision: 'New 2017',
    Quality: 'High',
    Source_Comments: '',
    Region: 'Oceania',
    Region_sub: 'Australia and New Zealand',
    Currency: 'Australian Dollar',
    Reference_Period: 'Year',
    Welfaredefn: 'Income, net',
    IncSharU: 'Household',
    UofAnala: 'Person',
    Equivsc: 'Household eq, sqrt (not adult eq)',
    AreaCovr: 'All',
    PopCovr: 'All',
    AgeCovr: 'All',
    EU: 'Non-EU',
    OECD: 'OECD',
    Year_cat: '2010-2015',
    Welfaredefn_new: 'Income, disposable',
    Equivsc_new: 'Other',
    AgeCovr_new: 'All',
    AreaCovr_new: 'All',
    PopCovr_new: 'All',
    IncSharU_new: 'Household',
    UofAnala_new: 'Person',
    Exchangerate: '1.09015948638677',
    Mean_usd: '45520.859375',
    Median_usd: '38522.80078125' } ]
#+end_example

#+BEGIN_SRC ein
var unrolled = S.pipe([
  S.chain(r =>
    S.map(i => {
      return { Country: r.Country, Decile: i, Income: Number.parseFloat(r.Mean_usd) * Number.parseFloat(r['D' + i.toString()]) / 10 }
    })(indices)
  ), S.map(r => r.Income === 0 ? S.insert('Income', 1, r) : r) // Can't have data at 0 due to log scale
])(latestWithDeciles)
S.maybeToNullable(S.take(5, unrolled))
#+END_SRC

#+RESULTS[79ac763035783f36db1f50da42d88268b0cccb38]:
: [ { Country: 'Albania', Decile: 1, Income: 204.92815820312518 },
:   { Country: 'Albania', Decile: 2, Income: 279.54873754882834 },
:   { Country: 'Albania', Decile: 3, Income: 334.6788670654299 },
:   { Country: 'Albania', Decile: 4, Income: 390.92273657226593 },
:   { Country: 'Albania', Decile: 5, Income: 448.8372160644535 } ]

#+BEGIN_SRC ein :file chart.html
var chart = {
  config: { line: { opacity: 0.2 } },
  data: { values: unrolled },
  mark: 'line',
  encoding: {
    x: { field: 'Decile', type: 'ordinal' },
    y: {
      field: 'Income',
      type: 'quantitative',
      scale: { type: 'log' }
     },
    color: { field: 'Country', type: 'nominal', legend: null }
  }
}
var tooltipOpts = { showAllFields: false, fields: [ { 'field': 'Country' } ] }
$$html$$ = plot.mkGraphHtml(chart, tooltipOpts)
#+END_SRC

#+RESULTS[4255e7eb660af8a422d32efe7ebe74c69334ef80]:
[[file:chart.html]]


